{"documents": ["A drift is considered critical if a test passed in the baseline but failed in the migrated code.", "A drift is considered non-critical if a test passed in both the baseline and migrated code, but the output changed.", "Behavior preservation percentage is calculated as the percentage of tests that pass in the migrated code compared to the total number of tests.", "Validation fails if there's no baseline or migrated repo.", "Output drift is ignored if the baseline output is empty.", "A drift is considered critical if a test passed in the baseline but failed in the migrated codebase.", "A drift is considered non-critical if a test passed in both baseline and migrated codebases, but the outputs are different.", "Behavior preservation percentage is calculated as the percentage of tests that pass in the migrated codebase.", "Drift descriptions are generated based on the type of drift, baseline result, and migrated result.", "A critical drift is defined as a test that passed in the baseline but failed after migration.", "A non-critical drift is defined as a test that passed in both baseline and migrated code, but the output changed.", "Drifts are classified by severity (critical or non-critical).", "Behavior preservation percentage is calculated as the percentage of tests that pass after migration.", "The validator fails if there is no baseline run, no migrated repo path, or no test suite.", "A drift is classified as critical if a test passed in the baseline but failed after migration.", "A drift is classified as non-critical if the output of a test changed after migration, but both the baseline and migrated tests passed.", "Behavior preservation percentage is calculated as the percentage of tests that pass after migration compared to the total number of tests.", "The validation process involves copying generated tests into the migrated repository before running them."], "ids": ["biz_557597d0827f845f_0_32223", "biz_557597d0827f845f_1_40992", "biz_557597d0827f845f_2_26288", "biz_557597d0827f845f_3_72721", "biz_557597d0827f845f_4_76445", "biz_557597d0827f845f_0_84522", "biz_557597d0827f845f_1_484", "biz_557597d0827f845f_2_86987", "biz_557597d0827f845f_3_83615", "biz_557597d0827f845f_0_15875", "biz_557597d0827f845f_1_32140", "biz_557597d0827f845f_2_45191", "biz_557597d0827f845f_3_88513", "biz_557597d0827f845f_4_72355", "biz_557597d0827f845f_0_68470", "biz_557597d0827f845f_1_56195", "biz_557597d0827f845f_2_51214", "biz_557597d0827f845f_3_53999"], "metadatas": [{"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}]}