{"documents": ["A drift is considered critical if a test passed in the baseline but failed in the migrated code.", "A drift is considered non-critical if a test passed in both the baseline and migrated code, but the output changed.", "Behavior preservation percentage is calculated as the percentage of tests that pass in the migrated code compared to the total number of tests.", "Validation fails if there's no baseline or migrated repo.", "Output drift is ignored if the baseline output is empty.", "A drift is considered critical if a test passed in the baseline but failed in the migrated codebase.", "A drift is considered non-critical if a test passed in both baseline and migrated codebases, but the outputs are different.", "Behavior preservation percentage is calculated as the percentage of tests that pass in the migrated codebase.", "Drift descriptions are generated based on the type of drift, baseline result, and migrated result.", "A critical drift is defined as a test that passed in the baseline but failed after migration.", "A non-critical drift is defined as a test that passed in both baseline and migrated code, but the output changed.", "Drifts are classified by severity (critical or non-critical).", "Behavior preservation percentage is calculated as the percentage of tests that pass after migration.", "The validator fails if there is no baseline run, no migrated repo path, or no test suite.", "A drift is classified as critical if a test passed in the baseline but failed after migration.", "A drift is classified as non-critical if the output of a test changed after migration, but both the baseline and migrated tests passed.", "Behavior preservation percentage is calculated as the percentage of tests that pass after migration compared to the total number of tests.", "The validation process involves copying generated tests into the migrated repository before running them.", "Validation fails early if there is no baseline run, migrated repository path, or test suite present in the pipeline state.", "A 'critical' drift occurs when a test passed in the baseline but fails in the migrated codebase.", "A 'non_critical' drift occurs when both baseline and migrated tests pass, but their non-empty output strings do not exactly match.", "The behavior preservation score is calculated as a percentage of passing tests over the total number of tests in the migrated codebase.", "Validation fails early if there is an existing pipeline error, or if the baseline, migrated repository path, or test suite are missing.", "A drift is classified as 'critical' if a test passed in the baseline but fails in the migrated codebase.", "A drift is classified as 'non_critical' (output drift) if the test passes in both environments but the non-empty output strings do not match.", "Behavior preservation percentage is calculated as the percentage of passing tests out of the total executed tests in the migrated repo.", "Captured baseline and generated output texts are truncated to the first 300 characters for drift reporting.", "A drift occurs if a test passed in the baseline but fails in the migrated codebase, or if both passed but their non-empty outputs differ.", "Drifts are assigned a 'critical' severity if they are failure-driven, and a 'non_critical' severity if they are output-difference-driven.", "Behavior preservation percentage is calculated strictly as the ratio of passing migrated tests to total migrated tests.", "The validator halts and updates the state with an error if baseline data, the migrated repository path, or test suite data are missing.", "Validation fails and aborts if prior baseline runs, migrated repository paths, or test suites are missing.", "Dynamic tests are written into a '_bloc_tests' directory within the migrated repository before execution.", "A drift is considered 'critical' if the baseline test passed but the migrated codebase test failed.", "A drift is considered 'non_critical' if both baseline and migrated tests passed, but their non-empty outputs differ.", "The behavior preservation percentage is strictly the ratio of passing migrated tests to total migrated tests.", "A drift is classified as critical (failure drift) if the baseline test passed but the migrated test failed.", "A drift is classified as non-critical (output drift) if both tests pass but their output strings differ and the baseline output is non-empty.", "Behavior preservation percentage is calculated as the ratio of passing migrated tests over total tests run.", "The validation process short-circuits with an error state if the baseline run, migrated codebase path, or test suite is missing."], "ids": ["biz_557597d0827f845f_0_32223", "biz_557597d0827f845f_1_40992", "biz_557597d0827f845f_2_26288", "biz_557597d0827f845f_3_72721", "biz_557597d0827f845f_4_76445", "biz_557597d0827f845f_0_84522", "biz_557597d0827f845f_1_484", "biz_557597d0827f845f_2_86987", "biz_557597d0827f845f_3_83615", "biz_557597d0827f845f_0_15875", "biz_557597d0827f845f_1_32140", "biz_557597d0827f845f_2_45191", "biz_557597d0827f845f_3_88513", "biz_557597d0827f845f_4_72355", "biz_557597d0827f845f_0_68470", "biz_557597d0827f845f_1_56195", "biz_557597d0827f845f_2_51214", "biz_557597d0827f845f_3_53999", "biz_557597d0827f845f_0_42328", "biz_557597d0827f845f_1_83385", "biz_557597d0827f845f_2_5245", "biz_557597d0827f845f_3_21823", "biz_557597d0827f845f_0_27912", "biz_557597d0827f845f_1_13231", "biz_557597d0827f845f_2_78706", "biz_557597d0827f845f_3_17271", "biz_557597d0827f845f_4_45828", "biz_557597d0827f845f_0_42111", "biz_557597d0827f845f_1_17063", "biz_557597d0827f845f_2_9508", "biz_557597d0827f845f_3_55703", "biz_557597d0827f845f_0_51368", "biz_557597d0827f845f_1_87137", "biz_557597d0827f845f_2_15515", "biz_557597d0827f845f_3_94385", "biz_557597d0827f845f_4_4094", "biz_557597d0827f845f_0_365", "biz_557597d0827f845f_1_44925", "biz_557597d0827f845f_2_20255", "biz_557597d0827f845f_3_89166"], "metadatas": [{"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}, {"type": "biz_logic"}]}